rgomez31UAQ/ESP32-DIV_CYD-Gadget/radio_test.cpp
// ═══════════════════════════════════════════════════════════════════════════
// HaleHound-CYD Radio Test Tool
// Interactive hardware verification for NRF24L01+, CC1101, and GPS
// Tap a radio name to run its test. Results show inline as PASS/FAIL.
// Includes wiring reference diagrams.
// Created: 2026-02-19
// Updated: 2026-03-20 — NRF24 spectrum scan + TX test,
//                        CC1101 signal detection, GPS test (from Duggie)
// ═══════════════════════════════════════════════════════════════════════════

#include "radio_test.h"
#include "cyd_config.h"
#include "shared.h"
#include "utils.h"
#include "touch_buttons.h"
#include "icon.h"
#include "nrf24_config.h"
#include "gps_module.h"
#include <SPI.h>
#include <TFT_eSPI.h>
#include <RF24.h>
#include <ELECHOUSE_CC1101_SRC_DRV.h>

extern TFT_eSPI tft;

// Forward declarations for functions defined in HaleHound-CYD.ino
extern void drawStatusBar();
extern void drawInoIconBar();

// Forward declaration for drawMainScreen (defined later in this file)
static void drawMainScreen();

// ═══════════════════════════════════════════════════════════════════════════
// SCREEN LAYOUT CONSTANTS
// 4 test buttons + wiring button, tighter spacing than before
// ═══════════════════════════════════════════════════════════════════════════

// Title at Y=60 (drawGlitchTitle)
// NRF24 button:   Y=80..99    (20px tall)
// NRF24 status:   Y=101 (one line)
// CC1101 button:  Y=115..134  (20px tall)
// CC1101 status:  Y=136 (one line)
// GPS button:     Y=150..169  (20px tall)
// GPS status:     Y=171 (one line)
// Wiring button:  Y=190..209  (20px tall)
// Hint:           Y=215

#define RT_NRF_BTN_Y     SCALE_Y(80)
#define RT_NRF_BTN_H     SCALE_H(20)
#define RT_NRF_STATUS_Y  SCALE_Y(101)
#define RT_NRF_HINT_Y    SCALE_Y(112)
#define RT_CC_BTN_Y      SCALE_Y(126)
#define RT_CC_BTN_H      SCALE_H(20)
#define RT_CC_STATUS_Y   SCALE_Y(147)
#define RT_CC_HINT_Y     SCALE_Y(158)
#define RT_GPS_BTN_Y     SCALE_Y(172)
#define RT_GPS_BTN_H     SCALE_H(20)
#define RT_GPS_STATUS_Y  SCALE_Y(193)
#define RT_GPS_HINT_Y    SCALE_Y(204)
#define RT_WIRE_BTN_Y    SCALE_Y(222)
#define RT_WIRE_BTN_H    SCALE_H(20)
#define RT_HINT_Y        SCALE_Y(248)
#define RT_BTN_X          10
#define RT_BTN_W         (SCREEN_WIDTH - 20)

// ═══════════════════════════════════════════════════════════════════════════
// DRAWING HELPERS
// ═══════════════════════════════════════════════════════════════════════════

static void drawRadioButton(int y, int h, const char* label, uint16_t color) {
    tft.fillRect(RT_BTN_X, y, RT_BTN_W, h, TFT_BLACK);
    tft.drawRoundRect(RT_BTN_X, y, RT_BTN_W, h, 4, color);
    tft.setTextColor(color, TFT_BLACK);
    tft.setTextFont(2);
    tft.setTextSize(1);
    int tw = tft.textWidth(label);
    int tx = RT_BTN_X + (RT_BTN_W - tw) / 2;
    int ty = y + (h - 16) / 2;
    tft.setCursor(tx, ty);
    tft.print(label);
}

static void drawStatusLine(int y, const char* text, uint16_t color) {
    tft.fillRect(0, y, SCREEN_WIDTH, 12, TFT_BLACK);
    tft.setTextColor(color, TFT_BLACK);
    tft.setTextFont(1);
    tft.setTextSize(1);
    int tw = tft.textWidth(text);
    int tx = (SCREEN_WIDTH - tw) / 2;
    if (tx < 5) tx = 5;
    tft.setCursor(tx, y);
    tft.print(text);
}

static void drawTestingIndicator(int statusY) {
    drawStatusLine(statusY, "Testing...", TFT_YELLOW);
    // Clear troubleshoot hint line too
    tft.fillRect(0, statusY + 12, SCREEN_WIDTH, 12, TFT_BLACK);
}

// ═══════════════════════════════════════════════════════════════════════════
// SPI HELPERS (same proven patterns as runBootDiagnostics)
// ═══════════════════════════════════════════════════════════════════════════

static void deselectAllCS() {
    pinMode(SD_CS, OUTPUT);       digitalWrite(SD_CS, HIGH);
    pinMode(CC1101_CS, OUTPUT);   digitalWrite(CC1101_CS, HIGH);
    pinMode(NRF24_CSN, OUTPUT);   digitalWrite(NRF24_CSN, HIGH);
    pinMode(NRF24_CE, OUTPUT);    digitalWrite(NRF24_CE, LOW);
}

static void spiReset4MHz() {
    SPI.end();
    delay(10);
    SPI.begin(VSPI_SCK, VSPI_MISO, VSPI_MOSI);
    SPI.setFrequency(4000000);
    delay(10);
}

// Raw NRF24 register read (manual CS toggle, no library dependency)
static byte rawNrfRead(byte reg) {
    byte val;
    digitalWrite(NRF24_CSN, LOW);
    delayMicroseconds(5);
    SPI.transfer(reg & 0x1F);    // R_REGISTER command
    val = SPI.transfer(0xFF);
    digitalWrite(NRF24_CSN, HIGH);
    return val;
}

// Raw NRF24 register write (manual CS toggle)
static void rawNrfWrite(byte reg, byte val) {
    digitalWrite(NRF24_CSN, LOW);
    delayMicroseconds(5);
    SPI.transfer((reg & 0x1F) | 0x20);  // W_REGISTER command
    SPI.transfer(val);
    digitalWrite(NRF24_CSN, HIGH);
}

// ═══════════════════════════════════════════════════════════════════════════
// NRF24 TEST — SPI check + spectrum scan + TX test (from Duggie)
// ═══════════════════════════════════════════════════════════════════════════

static void runNrfTest(int statusY, int hintY) {
    drawTestingIndicator(statusY);

    deselectAllCS();
    spiReset4MHz();

    // ── STAGE 1: SPI register check (existing proven logic) ──
    bool statusOK = false;
    byte statusVal = 0x00;
    int nrfDelays[] = {10, 100, 500};

    for (int attempt = 0; attempt < 3; attempt++) {
        delay(nrfDelays[attempt]);
        statusVal = rawNrfRead(0x07);  // 0x07 = STATUS register
        if (statusVal != 0x00 && statusVal != 0xFF) {
            statusOK = true;
            break;
        }
    }

    if (!statusOK) {
        char msg[48];
        if (statusVal == 0x00) {
            snprintf(msg, sizeof(msg), "FAIL  STATUS=0x00 (no power?)");
            drawStatusLine(statusY, msg, TFT_RED);
            { char hint[48]; snprintf(hint, sizeof(hint), "Check 3.3V and CSN wire (GPIO %d)", NRF24_CSN); drawStatusLine(hintY, hint, TFT_YELLOW); }
        } else {
            snprintf(msg, sizeof(msg), "FAIL  STATUS=0xFF (MISO stuck)");
            drawStatusLine(statusY, msg, TFT_RED);
            { char hint[48]; snprintf(hint, sizeof(hint), "Check MISO (GPIO 19) and CSN (GPIO %d)", NRF24_CSN); drawStatusLine(hintY, hint, TFT_YELLOW); }
        }
        return;
    }

    // Step 2: Write/readback test — write 0x3F to EN_AA, read it back
    rawNrfWrite(0x01, 0x3F);            // Write all-pipes-enabled
    delayMicroseconds(10);
    byte readback = rawNrfRead(0x01);   // Read it back
    rawNrfWrite(0x01, 0x00);            // Restore to disabled (our default)

    if (readback != 0x3F) {
        char msg[48];
        snprintf(msg, sizeof(msg), "FAIL  ST=0x%02X WR=0x%02X!=0x3F", statusVal, readback);
        drawStatusLine(statusY, msg, TFT_RED);
        drawStatusLine(hintY, "Check MOSI (GPIO 23) or 3.3V sag", TFT_YELLOW);
        return;
    }

    // SPI is good — now switch to RF24 library for spectrum + TX
    drawStatusLine(statusY, "SPI OK. Spectrum scan...", TFT_CYAN);
    tft.fillRect(0, hintY, SCREEN_WIDTH, 12, TFT_BLACK);

    // Restore SPI bus before RF24 library takes over
    SPI.end();
    delay(10);

