rgomez31UAQ/ESP32-DIV_CYD-Gadget/radio_test.cpp
    // ── STAGE 2: Spectrum scan (ported from Duggie) ──
    // Use the global nrf24Radio object from nrf24_config.h
    if (!nrf24Radio.begin()) {
        char msg[48];
        snprintf(msg, sizeof(msg), "PASS SPI  FAIL RF24 begin()");
        drawStatusLine(statusY, msg, TFT_YELLOW);
        drawStatusLine(hintY, "SPI works but library init failed", TFT_YELLOW);
        return;
    }

    nrf24Radio.setAutoAck(false);
    nrf24Radio.disableCRC();
    nrf24Radio.setRetries(0, 0);
    nrf24Radio.setPALevel(RF24_PA_LOW);   // Low power for RX scan
    nrf24Radio.setDataRate(RF24_2MBPS);
    nrf24Radio.startListening();

    const int NUM_CHANNELS = 126;
    const int NUM_SWEEPS   = 30;   // 30 sweeps (~4 seconds total)
    uint8_t signalCount[NUM_CHANNELS];
    memset(signalCount, 0, sizeof(signalCount));

    for (int sweep = 0; sweep < NUM_SWEEPS; sweep++) {
        for (int ch = 0; ch < NUM_CHANNELS; ch++) {
            nrf24Radio.setChannel(ch);
            delayMicroseconds(200);
            nrf24Radio.startListening();
            delayMicroseconds(200);
            nrf24Radio.stopListening();

            if (nrf24Radio.testRPD()) {
                if (signalCount[ch] < 255) signalCount[ch]++;
            }
        }
    }

    nrf24Radio.stopListening();

    int activeChannels = 0;
    uint8_t peakVal = 0;
    int peakCh = 0;
    for (int ch = 0; ch < NUM_CHANNELS; ch++) {
        if (signalCount[ch] > 0) activeChannels++;
        if (signalCount[ch] > peakVal) {
            peakVal = signalCount[ch];
            peakCh = ch;
        }
    }

    // ── STAGE 3: TX attempt (ported from Duggie) ──
    nrf24Radio.setAutoAck(true);
    nrf24Radio.enableDynamicPayloads();
    nrf24Radio.setRetries(5, 15);
    nrf24Radio.setChannel(120);
    nrf24Radio.setPALevel(RF24_PA_LOW);
    nrf24Radio.setDataRate(RF24_1MBPS);

    uint8_t testAddr[] = {0xE7, 0xE7, 0xE7, 0xE7, 0xE7};
    nrf24Radio.openWritingPipe(testAddr);
    nrf24Radio.openReadingPipe(1, testAddr);
    nrf24Radio.stopListening();

    uint8_t testPayload[] = {0xDE, 0xAD, 0xBE, 0xEF, 0x42};
    nrf24Radio.write(testPayload, sizeof(testPayload));
    bool txOK = nrf24Radio.isChipConnected();  // Chip still alive after TX

    nrf24Radio.flush_tx();
    nrf24Radio.flush_rx();

    // Clean up — full reinit then power down
    nrf24Radio.begin();
    nrf24Radio.powerDown();

    // ── RESULTS ──
    char msg[48];
    if (activeChannels > 3 && txOK) {
        snprintf(msg, sizeof(msg), "PASS  %dch peak@%d TX:OK", activeChannels, peakCh);
        drawStatusLine(statusY, msg, TFT_GREEN);
        tft.fillRect(0, hintY, SCREEN_WIDTH, 12, TFT_BLACK);
    } else if (txOK) {
        snprintf(msg, sizeof(msg), "PASS  %dch (quiet) TX:OK", activeChannels);
        drawStatusLine(statusY, msg, TFT_GREEN);
        drawStatusLine(hintY, "Low activity normal if no 2.4G sources", TFT_CYAN);
    } else {
        snprintf(msg, sizeof(msg), "WARN  %dch TX:FAIL", activeChannels);
        drawStatusLine(statusY, msg, TFT_YELLOW);
        drawStatusLine(hintY, "SPI+RX OK but TX attempt failed", TFT_YELLOW);
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// CC1101 TEST — SPI check + spectrum scan + keyfob detection (from Duggie)
// ═══════════════════════════════════════════════════════════════════════════

static void runCC1101Test(int statusY, int hintY) {
    drawTestingIndicator(statusY);

    deselectAllCS();

    // Reset SPI for ELECHOUSE library (it does its own SPI.begin)
    SPI.end();
    delay(10);

    // Deselect NRF24 explicitly (ELECHOUSE won't do it)
    pinMode(NRF24_CSN, OUTPUT);   digitalWrite(NRF24_CSN, HIGH);
    pinMode(SD_CS, OUTPUT);       digitalWrite(SD_CS, HIGH);

    // Pre-check: ELECHOUSE library has blocking while(digitalRead(MISO))
    // that freezes forever if no CC1101 is connected. Safe probe first.
    if (!cc1101SafeCheck()) {
        drawStatusLine(statusY, "FAIL  No CC1101 detected", TFT_RED);
        char hint[48];
        snprintf(hint, sizeof(hint), "Check CS (GPIO %d) and 3.3V power", CC1101_CS);
        drawStatusLine(hintY, hint, TFT_YELLOW);
        return;
    }

    // CC1101 responded on SPI — safe to use ELECHOUSE library now
    ELECHOUSE_cc1101.setSpiPin(VSPI_SCK, VSPI_MISO, VSPI_MOSI, CC1101_CS);
    ELECHOUSE_cc1101.setGDO(CC1101_GDO0, CC1101_GDO2);

    // Step 1: Check if chip responds on SPI
    bool detected = ELECHOUSE_cc1101.getCC1101();

    if (!detected) {
        drawStatusLine(statusY, "FAIL  No SPI response", TFT_RED);
        char hint[48];
        snprintf(hint, sizeof(hint), "Check CS (GPIO %d) and 3.3V power", CC1101_CS);
        drawStatusLine(hintY, hint, TFT_YELLOW);
        return;
    }

    // Step 2: Read VERSION register (0x31) — genuine CC1101 returns 0x14
    byte version = ELECHOUSE_cc1101.SpiReadStatus(0x31);

    if (version == 0x00 || version == 0xFF) {
        char msg[48];
        snprintf(msg, sizeof(msg), "FAIL  VER=0x%02X", version);
        drawStatusLine(statusY, msg, TFT_RED);
        drawStatusLine(hintY, "Check MISO (GPIO 19) solder joint", TFT_YELLOW);
        return;
    }

    // SPI verified — now do SubGHz spectrum scan (from Duggie)
    drawStatusLine(statusY, "SPI OK. Signal detect...", TFT_CYAN);
    tft.fillRect(0, hintY, SCREEN_WIDTH, 12, TFT_BLACK);

    // ── STAGE 2: Quick signal detection on 315 + 433.92 MHz ──
    // Ported from Duggie's keyfob detection — baseline + listen
    ELECHOUSE_cc1101.Init();
    ELECHOUSE_cc1101.setRxBW(325.00);
    ELECHOUSE_cc1101.SetRx();

    float listenFreqs[] = {315.0, 433.92};
    int numListen = 2;

    // Measure baseline RSSI on each frequency (noise floor)
    int baseline[2] = {-100, -100};
    for (int f = 0; f < numListen; f++) {
        ELECHOUSE_cc1101.setMHZ(listenFreqs[f]);
        delay(10);
        ELECHOUSE_cc1101.SetRx();
        delay(10);
        int sum = 0;
        for (int s = 0; s < 20; s++) {
            sum += ELECHOUSE_cc1101.getRssi();
            delay(2);
        }
        baseline[f] = sum / 20;
    }

