rgomez31UAQ/ESP32-DIV_CYD-Gadget/radio_test.cpp
    // Listen for 3 seconds for any signal above noise floor
    bool signalDetected = false;
    float detectedFreq = 0;
    int detectedRSSI = -200;
    unsigned long listenStart = millis();
    unsigned long listenTimeout = 3000;   // 3 second quick listen

    while (millis() - listenStart < listenTimeout) {
        for (int f = 0; f < numListen; f++) {
            ELECHOUSE_cc1101.setMHZ(listenFreqs[f]);
            delayMicroseconds(500);
            ELECHOUSE_cc1101.SetRx();
            delay(5);

            for (int s = 0; s < 5; s++) {
                int rssi = ELECHOUSE_cc1101.getRssi();
                if (rssi > baseline[f] + 15 && rssi > -60) {
                    signalDetected = true;
                    detectedFreq = listenFreqs[f];
                    detectedRSSI = rssi;
                    break;
                }
                delayMicroseconds(500);
            }
            if (signalDetected) break;
        }
        if (signalDetected) break;
    }

    ELECHOUSE_cc1101.setSidle();

    // ── RESULTS ──
    char msg[48];
    if (version == 0x14 && signalDetected) {
        snprintf(msg, sizeof(msg), "PASS VER=0x14 %.0fMHz %ddBm", detectedFreq, detectedRSSI);
        drawStatusLine(statusY, msg, TFT_GREEN);
        drawStatusLine(hintY, "Genuine CC1101 + SubGHz signal!", TFT_GREEN);
    } else if (version == 0x14) {
        snprintf(msg, sizeof(msg), "PASS  VER=0x14 (genuine CC1101)");
        drawStatusLine(statusY, msg, TFT_GREEN);
        drawStatusLine(hintY, "No 315/433 signal (normal)", TFT_CYAN);
    } else {
        snprintf(msg, sizeof(msg), "WARN  VER=0x%02X (clone chip?)", version);
        drawStatusLine(statusY, msg, TFT_YELLOW);
        drawStatusLine(hintY, "Works but not genuine TI CC1101", TFT_YELLOW);
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// GPS TEST — Queries the RUNNING GPS module's diagnostics
// Does NOT open its own UART2 — gps_module.cpp already owns it.
// Just reads the existing counters to verify data is flowing.
// ═══════════════════════════════════════════════════════════════════════════

#if CYD_HAS_GPS

// Draw a HaleHound gradient progress bar (MAGENTA → HOTPINK)
// Extracts RGB565 components at runtime since colors are extern variables.
static void drawGradientBar(int y, int h, float progress) {
    int barX = RT_BTN_X + 2;
    int barW = RT_BTN_W - 4;
    int fillW = (int)(barW * progress);
    if (fillW < 1) fillW = 1;
    if (fillW > barW) fillW = barW;

    // Background (dark)
    tft.fillRect(barX, y, barW, h, HALEHOUND_DARK);

    // Extract RGB565 components from actual theme colors
    uint8_t r1 = (HALEHOUND_MAGENTA >> 11) & 0x1F;
    uint8_t g1 = (HALEHOUND_MAGENTA >> 5)  & 0x3F;
    uint8_t b1 =  HALEHOUND_MAGENTA        & 0x1F;
    uint8_t r2 = (HALEHOUND_HOTPINK >> 11) & 0x1F;
    uint8_t g2 = (HALEHOUND_HOTPINK >> 5)  & 0x3F;
    uint8_t b2 =  HALEHOUND_HOTPINK        & 0x1F;

    // Gradient fill — lerp between the two colors
    for (int x = 0; x < fillW; x++) {
        float t = (float)x / (float)barW;
        uint8_t r = r1 + (uint8_t)((int)(r2 - r1) * t);
        uint8_t g = g1 + (uint8_t)((int)(g2 - g1) * t);
        uint8_t b = b1 + (uint8_t)((int)(b2 - b1) * t);
        uint16_t col = (r << 11) | (g << 5) | b;
        tft.drawFastVLine(barX + x, y, h, col);
    }

    // Border
    tft.drawRect(barX - 1, y - 1, barW + 2, h + 2, HALEHOUND_MAGENTA);
}

static void runGpsTest(int statusY, int hintY) {
    // Clear status area
    tft.fillRect(0, statusY, SCREEN_WIDTH, 24, TFT_BLACK);

    int barY = statusY;
    int barH = 10;

    // ── PHASE 1: Initialize GPS if needed (headless — no screen jump) ──
    Serial.end();           // Free GPIO 3 for UART2
    delay(50);

    drawStatusLine(hintY, "Initializing GPS...", HALEHOUND_GUNMETAL);
    drawGradientBar(barY, barH, 0.1f);

    gpsInitSilent();        // Pin scan + baud detect (returns fast if already init'd)

    drawGradientBar(barY, barH, 0.3f);

    // ── PHASE 2: Open UART2 for data collection ──
    gpsStartBackground();
    delay(500);

    drawGradientBar(barY, barH, 0.4f);
    drawStatusLine(hintY, "Sampling GPS data...", HALEHOUND_GUNMETAL);

    // Snapshot counters BEFORE sampling
    uint32_t charsBefore   = gpsCharsProcessed();
    uint32_t dollarsBefore = gpsDollarsSeen();
    uint32_t passedBefore  = gpsPassedChecksums();

    // ── PHASE 3: Actively feed GPS parser for 3 seconds with animated bar ──
    unsigned long gpsTestStart = millis();
    while (millis() - gpsTestStart < 3000) {
        gpsUpdate();
        float elapsed = (float)(millis() - gpsTestStart) / 3000.0f;
        drawGradientBar(barY, barH, 0.4f + elapsed * 0.5f);  // 0.4 → 0.9
        delay(50);
    }

    drawGradientBar(barY, barH, 1.0f);

    // Snapshot counters AFTER sampling
    uint32_t charsAfter   = gpsCharsProcessed();
    uint32_t dollarsAfter = gpsDollarsSeen();
    uint32_t passedAfter  = gpsPassedChecksums();

    uint32_t newChars   = charsAfter - charsBefore;
    uint32_t newDollars = dollarsAfter - dollarsBefore;
    uint32_t newPassed  = passedAfter - passedBefore;

    int sats = gpsRawSatValue();
    GPSStatus status = gpsGetStatus();
    bool isC5 = gpsIsC5Connected();

    // Close UART2 and clean up
    gpsStopBackground();

    // Brief pause to show full bar
    delay(300);

    // Clear bar area for results
    tft.fillRect(0, statusY, SCREEN_WIDTH, 24, TFT_BLACK);

    // ── RESULTS ──
    char msg[48];

    if (newPassed > 2) {
        if (sats > 0) {
            snprintf(msg, sizeof(msg), "PASS  %lu$ %dsat %s",
                     (unsigned long)newPassed, sats, isC5 ? "C5" : "NMEA");
            drawStatusLine(statusY, msg, TFT_GREEN);
            if (status >= GPS_FIX_2D) {
                drawStatusLine(hintY, "GPS has fix!", TFT_GREEN);
            } else {
                drawStatusLine(hintY, "Searching for fix...", TFT_CYAN);
            }
        } else {
            snprintf(msg, sizeof(msg), "PASS  %lu$ 0sat (cold start?)",
                     (unsigned long)newPassed);
            drawStatusLine(statusY, msg, TFT_GREEN);
            drawStatusLine(hintY, "NMEA OK, waiting for satellites", TFT_CYAN);
        }
    } else if (newDollars > 0) {
        snprintf(msg, sizeof(msg), "WARN  %lu$ (checksum fail?)",
                 (unsigned long)newDollars);
        drawStatusLine(statusY, msg, TFT_YELLOW);
        drawStatusLine(hintY, "Data flowing but NMEA incomplete", TFT_YELLOW);
    } else if (newChars > 0) {
        snprintf(msg, sizeof(msg), "WARN  %lu chars (no NMEA)",
                 (unsigned long)newChars);
        drawStatusLine(statusY, msg, TFT_YELLOW);
        drawStatusLine(hintY, "Bytes but no NMEA — wrong baud?", TFT_YELLOW);
    } else {
        snprintf(msg, sizeof(msg), "FAIL  0 bytes in 3s");
        drawStatusLine(statusY, msg, TFT_RED);
        drawStatusLine(hintY, "Check GPS TX -> CYD P1 RX wiring", TFT_YELLOW);
    }
}

