rgomez31UAQ/ESP32-DIV_CYD-Gadget/radio_test.cpp
#endif // CYD_HAS_GPS

// ═══════════════════════════════════════════════════════════════════════════
// WIRING DIAGRAMS — Duggie's KiCad layouts as TFT block diagrams
// 5 pages: text reference + NRF24 diagram + GPS diagram + CC1101 diagram + PN532 diagram
// ═══════════════════════════════════════════════════════════════════════════

static int wiringPage = 0;
#define WIRING_NUM_PAGES 6

// Diagram layout constants
#define DIAG_LEFT_X     5
#define DIAG_LEFT_W     SCALE_W(85)
#define DIAG_RIGHT_X    SCALE_X(150)
#define DIAG_RIGHT_W    SCALE_W(85)
#define DIAG_TRACE_X1   (DIAG_LEFT_X + DIAG_LEFT_W)
#define DIAG_TRACE_X2   DIAG_RIGHT_X

// Draw a single pin row with colored trace line between two chip boxes
static void drawPinTrace(int y, const char* leftPin, const char* rightPin,
                          uint16_t color, bool dashed = false) {
    int traceY = y + 4;

    // Left label (right-aligned inside left box)
    tft.setTextColor(color, TFT_BLACK);
    int lw = strlen(leftPin) * 6;
    tft.setCursor(DIAG_LEFT_X + DIAG_LEFT_W - lw - 8, y);
    tft.print(leftPin);

    // Solder dots at box edges
    tft.fillCircle(DIAG_TRACE_X1, traceY, 2, color);
    tft.fillCircle(DIAG_TRACE_X2, traceY, 2, color);

    // Trace line (2px thick for visibility)
    if (dashed) {
        for (int x = DIAG_TRACE_X1 + 4; x < DIAG_TRACE_X2 - 4; x += 8) {
            tft.drawFastHLine(x, traceY, 4, color);
            tft.drawFastHLine(x, traceY + 1, 4, color);
        }
    } else {
        int len = DIAG_TRACE_X2 - DIAG_TRACE_X1 - 6;
        tft.drawFastHLine(DIAG_TRACE_X1 + 3, traceY, len, color);
        tft.drawFastHLine(DIAG_TRACE_X1 + 3, traceY + 1, len, color);
    }

    // Right label (left-aligned inside right box)
    tft.setCursor(DIAG_RIGHT_X + 8, y);
    tft.print(rightPin);
}

// Draw page navigation footer
static void drawPageNav(int page, int total) {
    tft.setTextFont(1);
    tft.setTextSize(1);

    int navY = SCREEN_HEIGHT - 33;

    // Left/right arrows
    tft.setTextColor(HALEHOUND_MAGENTA, TFT_BLACK);
    tft.setCursor(15, navY);
    tft.print("<");
    tft.setCursor(SCREEN_WIDTH - 21, navY);
    tft.print(">");

    // Page number
    char buf[8];
    snprintf(buf, sizeof(buf), "%d/%d", page + 1, total);
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    int tw = strlen(buf) * 6;
    tft.setCursor((SCREEN_WIDTH - tw) / 2, navY);
    tft.print(buf);

    // Navigation hint
    tft.setTextColor(HALEHOUND_GUNMETAL, TFT_BLACK);
    tft.setCursor(22, SCREEN_HEIGHT - 15);
    tft.print("TAP </> = Page  BACK = Exit");
}

// ── Page 0: Text wiring reference (original pin lists) ──
static void drawWiringText() {
    tft.fillScreen(TFT_BLACK);
    drawStatusBar();
    drawInoIconBar();
    drawGlitchTitle(SCALE_Y(60), "WIRING");

    tft.setTextFont(1);
    tft.setTextSize(1);
    int y = SCALE_Y(75);
    int lineH = 10;

    // NRF24 section
    tft.setTextColor(TFT_CYAN, TFT_BLACK);
    tft.setCursor(10, y);
    tft.print("--- NRF24L01+PA+LNA ---");
    y += lineH + 2;

    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.setCursor(10, y);  tft.print("VCC  = 3.3V     GND = GND");
    y += lineH;
    tft.setCursor(10, y);  tft.printf("CSN  = GPIO %-3d CE  = GPIO %d", NRF24_CSN, NRF24_CE);
    y += lineH;
    tft.setCursor(10, y);  tft.printf("SCK  = GPIO %-3d MOSI= GPIO %d", VSPI_SCK, VSPI_MOSI);
    y += lineH;
    tft.setCursor(10, y);  tft.printf("MISO = GPIO %-3d IRQ = N/C", VSPI_MISO);
    y += lineH + 4;

    // CC1101 section
    tft.setTextColor(TFT_CYAN, TFT_BLACK);
    tft.setCursor(10, y);
    tft.print("--- CC1101 SubGHz ---");
    y += lineH + 2;

    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.setCursor(10, y);  tft.print("VCC  = 3.3V     GND = GND");
    y += lineH;
    tft.setCursor(10, y);  tft.printf("CS   = GPIO %-3d SCK = GPIO %d", CC1101_CS, VSPI_SCK);
    y += lineH;
    tft.setCursor(10, y);  tft.printf("MOSI = GPIO %-3d MISO= GPIO %d", VSPI_MOSI, VSPI_MISO);
    y += lineH;
    tft.setCursor(10, y);  tft.printf("GDO0 = GPIO %-3d GDO2= GPIO %d", CC1101_GDO0, CC1101_GDO2);
    y += lineH;

    tft.setTextColor(TFT_YELLOW, TFT_BLACK);
    tft.setCursor(10, y);  tft.print("GDO0=TX(out) GDO2=RX(in)");
    y += lineH + 4;

    // PN532 section
    tft.setTextColor(TFT_CYAN, TFT_BLACK);
    tft.setCursor(10, y);
    tft.print("--- PN532 RFID (13.56 MHz) ---");
    y += lineH + 2;

    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.setCursor(10, y);  tft.print("VCC  = 3.3V     GND = GND");
    y += lineH;
    tft.setCursor(10, y);  tft.printf("CS   = GPIO %-3d SCK = GPIO %d", PN532_CS, VSPI_SCK);
    y += lineH;
    tft.setCursor(10, y);  tft.printf("MOSI = GPIO %-3d MISO= GPIO %d", VSPI_MOSI, VSPI_MISO);
    y += lineH;

    tft.setTextColor(TFT_YELLOW, TFT_BLACK);
    tft.setCursor(10, y);  tft.print("DIP: Both switches SPI mode");
    y += lineH + 4;

    // Shared SPI note
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setCursor(10, y);
    tft.printf("All radios + SD + PN532 = VSPI  SD CS=%d", SD_CS);

    drawPageNav(0, WIRING_NUM_PAGES);
}

// ── Page 1: NRF24L01+ block diagram ──
static void drawNrf24Diagram() {
    tft.fillScreen(TFT_BLACK);
    drawStatusBar();
    drawInoIconBar();
    drawGlitchTitle(SCALE_Y(60), "NRF24 WIRING");

    tft.setTextFont(1);
    tft.setTextSize(1);

    int pinSpace = SCALE_Y(18);
    int boxY = SCALE_Y(82);
    int boxH = 8 * pinSpace + 22;

    // Left box — ESP32
    tft.drawRect(DIAG_LEFT_X, boxY, DIAG_LEFT_W, boxH, HALEHOUND_MAGENTA);
    tft.drawRect(DIAG_LEFT_X + 1, boxY + 1, DIAG_LEFT_W - 2, boxH - 2, HALEHOUND_DARK);
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setCursor(DIAG_LEFT_X + 25, boxY + 4);
    tft.print("ESP32");

    // Right box — NRF24L01+
    tft.drawRect(DIAG_RIGHT_X, boxY, DIAG_RIGHT_W, boxH, HALEHOUND_MAGENTA);
    tft.drawRect(DIAG_RIGHT_X + 1, boxY + 1, DIAG_RIGHT_W - 2, boxH - 2, HALEHOUND_DARK);
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setCursor(DIAG_RIGHT_X + 8, boxY + 4);
    tft.print("NRF24L01+");

