rgomez31UAQ/ESP32-DIV_CYD-Gadget/radio_test.cpp
    // Pin traces — color coded like Duggie's KiCad
    int py = boxY + 20;
    drawPinTrace(py, "3.3V",  "VCC",  TFT_RED,            false);  py += pinSpace;
    drawPinTrace(py, "GND",   "GND",  TFT_WHITE,          false);  py += pinSpace;
    drawPinTrace(py, "IO18",  "SCK",  TFT_CYAN,           false);  py += pinSpace;
    drawPinTrace(py, "IO23",  "MOSI", TFT_CYAN,           false);  py += pinSpace;
    drawPinTrace(py, "IO19",  "MISO", TFT_CYAN,           false);  py += pinSpace;
    { char csnLabel[8]; snprintf(csnLabel, sizeof(csnLabel), "IO%d", NRF24_CSN);
    drawPinTrace(py, csnLabel, "CSN", HALEHOUND_MAGENTA,  false); }  py += pinSpace;
    { char ceLabel[8]; snprintf(ceLabel, sizeof(ceLabel), "IO%d", NRF24_CE);
    drawPinTrace(py, ceLabel, "CE",   HALEHOUND_MAGENTA,  false); }  py += pinSpace;
    drawPinTrace(py, "IO17",  "IRQ",  HALEHOUND_GUNMETAL, true);

    // Notes
    int noteY = boxY + boxH + 6;
    tft.setTextColor(TFT_RED, TFT_BLACK);
    tft.setCursor(5, noteY);
    { char cnNote[48]; snprintf(cnNote, sizeof(cnNote), "3.3V+GND from CN1 (IO22/IO%d plug)", CC1101_CS); tft.print(cnNote); }
    tft.setTextColor(TFT_GREEN, TFT_BLACK);
    tft.setCursor(5, noteY + 14);
    tft.print("No cap needed from this source!");
    tft.setTextColor(TFT_YELLOW, TFT_BLACK);
    tft.setCursor(5, noteY + 28);
    tft.print("Shares VSPI with CC1101 + SD");

    drawPageNav(1, WIRING_NUM_PAGES);
}

// ── Page 2: GPS block diagram ──
static void drawGpsDiagram() {
    tft.fillScreen(TFT_BLACK);
    drawStatusBar();
    drawInoIconBar();
    drawGlitchTitle(SCALE_Y(60), "GPS WIRING");

    tft.setTextFont(1);
    tft.setTextSize(1);

    int pinSpace = SCALE_Y(22);
    int boxY = SCALE_Y(95);
    int boxH = 4 * pinSpace + 22;

    // Left box — CYD P1 Connector
    tft.drawRect(DIAG_LEFT_X, boxY, DIAG_LEFT_W, boxH, HALEHOUND_MAGENTA);
    tft.drawRect(DIAG_LEFT_X + 1, boxY + 1, DIAG_LEFT_W - 2, boxH - 2, HALEHOUND_DARK);
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setCursor(DIAG_LEFT_X + 15, boxY + 4);
    tft.print("CYD  P1");

    // Right box — GT-U7 GPS
    tft.drawRect(DIAG_RIGHT_X, boxY, DIAG_RIGHT_W, boxH, HALEHOUND_MAGENTA);
    tft.drawRect(DIAG_RIGHT_X + 1, boxY + 1, DIAG_RIGHT_W - 2, boxH - 2, HALEHOUND_DARK);
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setCursor(DIAG_RIGHT_X + 6, boxY + 4);
    tft.print("GT-U7 GPS");

    // Pin traces
    int py = boxY + 22;
    drawPinTrace(py, "VIN",    "VCC", TFT_RED,            false);  py += pinSpace;
    drawPinTrace(py, "GND",    "GND", TFT_WHITE,          false);  py += pinSpace;
    drawPinTrace(py, "RX IO3", "TX",  TFT_CYAN,           false);  py += pinSpace;
    drawPinTrace(py, "TX IO1", "RX",  TFT_CYAN,          false);

    // Notes
    int noteY = boxY + boxH + 10;
    tft.setTextColor(TFT_RED, TFT_BLACK);
    tft.setCursor(5, noteY);
    tft.print("GPIO3 shared with CH340C USB!");
    noteY += 14;
    tft.setTextColor(TFT_YELLOW, TFT_BLACK);
    tft.setCursor(5, noteY);
    tft.print("Serial.end() before GPS init");

    drawPageNav(2, WIRING_NUM_PAGES);
}

// ── Page 3: CC1101 block diagram ──
static void drawCC1101Diagram() {
    tft.fillScreen(TFT_BLACK);
    drawStatusBar();
    drawInoIconBar();
    drawGlitchTitle(SCALE_Y(60), "CC1101 HW-863");

    tft.setTextFont(1);
    tft.setTextSize(1);

    int pinSpace = SCALE_Y(18);
    int boxY = SCALE_Y(82);
    int boxH = 8 * pinSpace + 22;

    // Left box — ESP32
    tft.drawRect(DIAG_LEFT_X, boxY, DIAG_LEFT_W, boxH, HALEHOUND_MAGENTA);
    tft.drawRect(DIAG_LEFT_X + 1, boxY + 1, DIAG_LEFT_W - 2, boxH - 2, HALEHOUND_DARK);
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setCursor(DIAG_LEFT_X + 25, boxY + 4);
    tft.print("ESP32");

    // Right box — CC1101
    tft.drawRect(DIAG_RIGHT_X, boxY, DIAG_RIGHT_W, boxH, HALEHOUND_MAGENTA);
    tft.drawRect(DIAG_RIGHT_X + 1, boxY + 1, DIAG_RIGHT_W - 2, boxH - 2, HALEHOUND_DARK);
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setCursor(DIAG_RIGHT_X + 18, boxY + 4);
    tft.print("CC1101");

    // Pin traces — color coded like Duggie's KiCad
    int py = boxY + 20;
    drawPinTrace(py, "3.3V",  "VCC",     TFT_RED,           false);  py += pinSpace;
    drawPinTrace(py, "GND",   "GND",     TFT_WHITE,         false);  py += pinSpace;
    char csLabel[8];
    snprintf(csLabel, sizeof(csLabel), "IO%d", CC1101_CS);
    drawPinTrace(py, csLabel,  "CS",      HALEHOUND_MAGENTA, false);  py += pinSpace;
    drawPinTrace(py, "IO18",  "SCK",     TFT_CYAN,          false);  py += pinSpace;
    drawPinTrace(py, "IO23",  "MOSI",    TFT_CYAN,          false);  py += pinSpace;
    drawPinTrace(py, "IO19",  "MISO",    TFT_CYAN,          false);  py += pinSpace;
    drawPinTrace(py, "IO22",  "GDO0 TX", HALEHOUND_HOTPINK, false);  py += pinSpace;
    drawPinTrace(py, "IO35",  "GDO2 RX", TFT_YELLOW,        false);

    // Notes
    int noteY = boxY + boxH + 6;
    tft.setTextColor(TFT_RED, TFT_BLACK);
    tft.setCursor(5, noteY);
    { char cnNote[48]; snprintf(cnNote, sizeof(cnNote), "3.3V+GND from CN1 (IO22/IO%d plug)", CC1101_CS); tft.print(cnNote); }
    tft.setTextColor(TFT_GREEN, TFT_BLACK);
    tft.setCursor(5, noteY + 14);
    tft.print("No cap needed from this source!");
    tft.setTextColor(TFT_YELLOW, TFT_BLACK);
    tft.setCursor(5, noteY + 28);
    tft.print("GDO0=TX(out)  GDO2=RX(in)");
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setCursor(5, noteY + 42);
    tft.print("CS=CN1  GDO0/GDO2=P3 connector");

    drawPageNav(3, WIRING_NUM_PAGES);
}

// ── Page 4: CC1101 E07-433M20S PA module block diagram ──
static void drawCC1101PADiagram() {
    tft.fillScreen(TFT_BLACK);
    drawStatusBar();
    drawInoIconBar();
    drawGlitchTitle(SCALE_Y(60), "CC1101 E07-PA");

    tft.setTextFont(1);
    tft.setTextSize(1);

    int pinSpace = SCALE_Y(16);
    int boxY = SCALE_Y(78);
    int boxH = 10 * pinSpace + 22;

    // Left box — ESP32
    tft.drawRect(DIAG_LEFT_X, boxY, DIAG_LEFT_W, boxH, HALEHOUND_MAGENTA);
    tft.drawRect(DIAG_LEFT_X + 1, boxY + 1, DIAG_LEFT_W - 2, boxH - 2, HALEHOUND_DARK);
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setCursor(DIAG_LEFT_X + 25, boxY + 4);
    tft.print("ESP32");

    // Right box — E07-433M20S
    tft.drawRect(DIAG_RIGHT_X, boxY, DIAG_RIGHT_W, boxH, HALEHOUND_MAGENTA);
    tft.drawRect(DIAG_RIGHT_X + 1, boxY + 1, DIAG_RIGHT_W - 2, boxH - 2, HALEHOUND_DARK);
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setCursor(DIAG_RIGHT_X + 6, boxY + 4);
    tft.print("E07-433M20S");

    // Pin traces — same base as HW-863 plus TX_EN/RX_EN
    int py = boxY + 20;
    drawPinTrace(py, "3.3V",  "VCC",     TFT_RED,           false);  py += pinSpace;
    drawPinTrace(py, "GND",   "GND",     TFT_WHITE,         false);  py += pinSpace;
    { char csLabel[8]; snprintf(csLabel, sizeof(csLabel), "IO%d", CC1101_CS);
    drawPinTrace(py, csLabel,  "CS",      HALEHOUND_MAGENTA, false); }  py += pinSpace;
    drawPinTrace(py, "IO18",  "SCK",     TFT_CYAN,          false);  py += pinSpace;
    drawPinTrace(py, "IO23",  "MOSI",    TFT_CYAN,          false);  py += pinSpace;
    drawPinTrace(py, "IO19",  "MISO",    TFT_CYAN,          false);  py += pinSpace;
    drawPinTrace(py, "IO22",  "GDO0 TX", HALEHOUND_HOTPINK, false);  py += pinSpace;
    drawPinTrace(py, "IO35",  "GDO2 RX", TFT_YELLOW,        false);  py += pinSpace;
#ifdef CC1101_TX_EN
    { char txLabel[8]; snprintf(txLabel, sizeof(txLabel), "IO%d", CC1101_TX_EN);
    drawPinTrace(py, txLabel, "TX_EN",   TFT_GREEN,         false); }  py += pinSpace;
#else
    drawPinTrace(py, "IO26",  "TX_EN",   TFT_GREEN,         false);  py += pinSpace;
#endif
#ifdef CC1101_RX_EN
    { char rxLabel[8]; snprintf(rxLabel, sizeof(rxLabel), "IO%d", CC1101_RX_EN);
    drawPinTrace(py, rxLabel, "RX_EN",   TFT_GREEN,         false); }
#else
    drawPinTrace(py, "IO0",   "RX_EN",   TFT_GREEN,         false);
#endif

    // Notes
    int noteY = boxY + boxH + 4;
    tft.setTextColor(TFT_GREEN, TFT_BLACK);
    tft.setCursor(5, noteY);
    tft.print("TX_EN=HIGH:transmit RX_EN=HIGH:receive");
    tft.setTextColor(TFT_YELLOW, TFT_BLACK);
    tft.setCursor(5, noteY + 13);
    tft.print("Enable: Settings > CC1101 > E07 PA");

