rgomez31UAQ/ESP32-DIV_CYD-Gadget/radio_test.cpp
    drawPageNav(4, WIRING_NUM_PAGES);
}

// ── Page 5: PN532 RFID block diagram ──
static void drawPN532Diagram() {
    tft.fillScreen(TFT_BLACK);
    drawStatusBar();
    drawInoIconBar();
    drawGlitchTitle(SCALE_Y(60), "PN532 WIRING");

    tft.setTextFont(1);
    tft.setTextSize(1);

    int pinSpace = SCALE_Y(22);
    int boxY = SCALE_Y(85);
    int boxH = 6 * pinSpace + 22;

    // Left box — ESP32
    tft.drawRect(DIAG_LEFT_X, boxY, DIAG_LEFT_W, boxH, HALEHOUND_MAGENTA);
    tft.drawRect(DIAG_LEFT_X + 1, boxY + 1, DIAG_LEFT_W - 2, boxH - 2, HALEHOUND_DARK);
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setCursor(DIAG_LEFT_X + 25, boxY + 4);
    tft.print("ESP32");

    // Right box — PN532
    tft.drawRect(DIAG_RIGHT_X, boxY, DIAG_RIGHT_W, boxH, HALEHOUND_MAGENTA);
    tft.drawRect(DIAG_RIGHT_X + 1, boxY + 1, DIAG_RIGHT_W - 2, boxH - 2, HALEHOUND_DARK);
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setCursor(DIAG_RIGHT_X + 14, boxY + 4);
    tft.print("PN532 V3");

    // Pin traces
    int py = boxY + 22;
    drawPinTrace(py, "3.3V",  "VCC",  TFT_RED,            false);  py += pinSpace;
    drawPinTrace(py, "GND",   "GND",  TFT_WHITE,          false);  py += pinSpace;
    { char csLabel[8]; snprintf(csLabel, sizeof(csLabel), "IO%d", PN532_CS);
    drawPinTrace(py, csLabel, "SS",   HALEHOUND_MAGENTA,  false); }  py += pinSpace;
    drawPinTrace(py, "IO18",  "SCK",  TFT_CYAN,           false);  py += pinSpace;
    drawPinTrace(py, "IO23",  "MOSI", TFT_CYAN,           false);  py += pinSpace;
    drawPinTrace(py, "IO19",  "MISO", TFT_CYAN,           false);

    // Notes
    int noteY = boxY + boxH + 6;
    tft.setTextColor(TFT_RED, TFT_BLACK);
    tft.setCursor(5, noteY);
    tft.print("DIP: Both switches to SPI mode");
    noteY += 14;
    tft.setTextColor(TFT_YELLOW, TFT_BLACK);
    tft.setCursor(5, noteY);
    tft.print("LSBFIRST SPI (lib handles auto)");
    noteY += 14;
    tft.setTextColor(TFT_GREEN, TFT_BLACK);
    tft.setCursor(5, noteY);
    tft.print("Shares VSPI with NRF24+CC1101+SD");
    noteY += 14;
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setCursor(5, noteY);
    tft.printf("CS=GPIO %d (was NRF24 IRQ, unused)", PN532_CS);

    drawPageNav(5, WIRING_NUM_PAGES);
}

// Page dispatcher
static void drawCurrentWiringPage() {
    switch (wiringPage) {
        case 0:  drawWiringText();    break;
        case 1:  drawNrf24Diagram();  break;
        case 2:  drawGpsDiagram();    break;
        case 3:  drawCC1101Diagram();   break;
        case 4:  drawCC1101PADiagram(); break;
        case 5:  drawPN532Diagram();    break;
        default: drawWiringText();    break;
    }
}

// Multi-page wiring viewer with LEFT/RIGHT navigation
static void showWiringScreen() {
    wiringPage = 0;
    drawCurrentWiringPage();

    bool exitWiring = false;
    while (!exitWiring) {
        touchButtonsUpdate();

        if (isBackButtonTapped() || buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
            exitWiring = true;
            break;
        }

        // Right arrow — tap right side of screen
        if (isTouchInArea(SCREEN_WIDTH - 60, SCREEN_HEIGHT - 45, 60, 40) || buttonPressed(BTN_RIGHT)) {
            wiringPage = (wiringPage + 1) % WIRING_NUM_PAGES;
            drawCurrentWiringPage();
            delay(250);
        }

        // Left arrow — tap left side of screen
        if (isTouchInArea(0, SCREEN_HEIGHT - 45, 60, 40) || buttonPressed(BTN_LEFT)) {
            wiringPage = (wiringPage + WIRING_NUM_PAGES - 1) % WIRING_NUM_PAGES;
            drawCurrentWiringPage();
            delay(250);
        }

        delay(20);
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// MAIN SCREEN
// ═══════════════════════════════════════════════════════════════════════════

static void drawMainScreen() {
    tft.fillScreen(TFT_BLACK);
    drawStatusBar();
    drawInoIconBar();
    drawGlitchTitle(SCALE_Y(60), "RADIO TEST");

    // NRF24 button and status
    drawRadioButton(RT_NRF_BTN_Y, RT_NRF_BTN_H, "[ NRF24L01+ ]", HALEHOUND_MAGENTA);
    drawStatusLine(RT_NRF_STATUS_Y, "Status: --", HALEHOUND_GUNMETAL);

    // CC1101 button and status
    drawRadioButton(RT_CC_BTN_Y, RT_CC_BTN_H, "[ CC1101 ]", HALEHOUND_MAGENTA);
    drawStatusLine(RT_CC_STATUS_Y, "Status: --", HALEHOUND_GUNMETAL);

    // GPS button and status
#if CYD_HAS_GPS
    drawRadioButton(RT_GPS_BTN_Y, RT_GPS_BTN_H, "[ GPS ]", HALEHOUND_MAGENTA);
    drawStatusLine(RT_GPS_STATUS_Y, "Status: --", HALEHOUND_GUNMETAL);
#else
    drawRadioButton(RT_GPS_BTN_Y, RT_GPS_BTN_H, "[ GPS N/A ]", HALEHOUND_GUNMETAL);
    drawStatusLine(RT_GPS_STATUS_Y, "GPS disabled in config", HALEHOUND_GUNMETAL);
#endif

    // Wiring reference button
    drawRadioButton(RT_WIRE_BTN_Y, RT_WIRE_BTN_H, "[ WIRING ]", HALEHOUND_HOTPINK);

    // Hint
    drawCenteredText(RT_HINT_Y, "Tap radio to test", HALEHOUND_HOTPINK, 1);
}

void radioTestScreen() {
    drawMainScreen();

    bool exitRequested = false;

    while (!exitRequested) {
        touchButtonsUpdate();

        // Check back button (icon bar tap or hardware BOOT button)
        if (isBackButtonTapped() || buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
            exitRequested = true;
            break;
        }

        // Check NRF24 button tap
        if (isTouchInArea(RT_BTN_X, RT_NRF_BTN_Y, RT_BTN_W, RT_NRF_BTN_H)) {
            drawRadioButton(RT_NRF_BTN_Y, RT_NRF_BTN_H, "[ NRF24L01+ ]", TFT_WHITE);
            delay(100);
            drawRadioButton(RT_NRF_BTN_Y, RT_NRF_BTN_H, "[ NRF24L01+ ]", HALEHOUND_MAGENTA);

            runNrfTest(RT_NRF_STATUS_Y, RT_NRF_HINT_Y);

            tft.fillRect(0, RT_HINT_Y, SCREEN_WIDTH, 14, TFT_BLACK);
            drawCenteredText(RT_HINT_Y, "Tap again to re-test", HALEHOUND_GUNMETAL, 1);

            delay(300);  // Debounce
        }

        // Check CC1101 button tap
        if (isTouchInArea(RT_BTN_X, RT_CC_BTN_Y, RT_BTN_W, RT_CC_BTN_H)) {
            drawRadioButton(RT_CC_BTN_Y, RT_CC_BTN_H, "[ CC1101 ]", TFT_WHITE);
            delay(100);
            drawRadioButton(RT_CC_BTN_Y, RT_CC_BTN_H, "[ CC1101 ]", HALEHOUND_MAGENTA);

            runCC1101Test(RT_CC_STATUS_Y, RT_CC_HINT_Y);

            tft.fillRect(0, RT_HINT_Y, SCREEN_WIDTH, 14, TFT_BLACK);
            drawCenteredText(RT_HINT_Y, "Tap again to re-test", HALEHOUND_GUNMETAL, 1);

            delay(300);  // Debounce
        }

        // Check GPS button tap
#if CYD_HAS_GPS
        if (isTouchInArea(RT_BTN_X, RT_GPS_BTN_Y, RT_BTN_W, RT_GPS_BTN_H)) {
            drawRadioButton(RT_GPS_BTN_Y, RT_GPS_BTN_H, "[ GPS ]", TFT_WHITE);
            delay(100);
            drawRadioButton(RT_GPS_BTN_Y, RT_GPS_BTN_H, "[ GPS ]", HALEHOUND_MAGENTA);

            runGpsTest(RT_GPS_STATUS_Y, RT_GPS_HINT_Y);

            tft.fillRect(0, RT_HINT_Y, SCREEN_WIDTH, 14, TFT_BLACK);
            drawCenteredText(RT_HINT_Y, "Tap again to re-test", HALEHOUND_GUNMETAL, 1);

            delay(300);  // Debounce
        }
#endif

        // Check WIRING button tap
        if (isTouchInArea(RT_BTN_X, RT_WIRE_BTN_Y, RT_BTN_W, RT_WIRE_BTN_H)) {
            drawRadioButton(RT_WIRE_BTN_Y, RT_WIRE_BTN_H, "[ WIRING ]", TFT_WHITE);
            delay(100);

            showWiringScreen();

            // Redraw main screen when returning from wiring
            drawMainScreen();

            delay(300);  // Debounce
        }

        delay(20);
    }

    // Cleanup — restore SPI bus to clean state for spiManager
    SPI.end();
    delay(5);
    SPI.begin(VSPI_SCK, VSPI_MISO, VSPI_MOSI);
    deselectAllCS();
}
